app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MAth"], ["category", "MATH"], ["created_at", "2018-08-18 01:02:29.927784"], ["updated_at", "2018-08-18 01:02:29.927784"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save